//*****************************************************************************
//
// デバッグコンソールクラス
//
// Author		: Kenji Kabutomori
//
//*****************************************************************************

//*****************************************************************************
// include gaurd
//*****************************************************************************
#pragma once

#ifndef _DEBUG_CONSOLE_H_
#define _DEBUG_CONSOLE_H_

//*****************************************************************************
// include
//*****************************************************************************
#include "basic/basic.h"
#include <windows.h>

//*****************************************************************************
// macro definition
//*****************************************************************************

//*****************************************************************************
// constant definition
//*****************************************************************************

//*****************************************************************************
// structure definition
//*****************************************************************************

//*****************************************************************************
// class definition
//*****************************************************************************
class DebugConsole : public Basic
{
public:
	// constructor
	DebugConsole(void);

	// destructor
	~DebugConsole(void);

	// initializer
	bool Initialize(void);

	// 更新
	void Update(void);

	// 描画
	void Draw(void);

	// 終了
	void Uninitialize(void);

	// 出力
	void Print(const char* pFormat,...);

	// 表示
	void Show(void);

	// 非表示
	void Hide(void);

	// 表示切り換え
	void SwitchWindow(void);

protected:

private:
	static const char* TITLE;
	static const int STRING_MAX = 1024;
	HWND hwnd_;
	char log_[STRING_MAX];

	u32 console_;
	bool change_flag_;
	bool show_flag_;
};

#endif // _DEBUG_CONSOLE_H_

//---------------------------------- EOF --------------------------------------
